import React from "react";
import { DefaultCard } from "../Card";
const Sections = () => (
  <DefaultCard center>
    <h2>السيرة الذاتية</h2>
    <p>
      استشاري جراحه تجميل الأنف و الوجه حاصل على الدكتوراه من جامعه باريس في أمراض الأنف و الأذن و الحنجرة حاصل على
      الدكتوراه من اعرق جامعات العالم في تجميل الأنف و الوجه و الرقبة من جامعه باريس دوز في جراحه تجميل الأنف و الوجه و
      الرقبة . خبره طويلة في جراحات تجميل الأنف بمختلف تشوهاته بالإضافة إلى أمراض الأنف و الجيوب الأنفية
    </p>
  </DefaultCard>
);

export default Sections;
