import React from "react";
import styled from "styled-components";
import { ServiceCard } from "../Card";
const StyledServices = styled.section`
  width: 100%;
  text-align: center;
  background-color: beige;
  h3 {
    font-size: 2rem;
  }
  h4 {
    margin-top: -20px;
  }
  h5 {
    font-size: 1.2rem;
    margin-bottom: -10px;
  }
`;
const ServiceCards = styled.div`
  display: flex;
  flex-wrap: wrap;
  margin: 50px 20px;
  margin-top: 50px;
`;

const Services = () => (
  <StyledServices>
    <h3> خدماتنا المميزة </h3>
    <ServiceCards>
      <ServiceCard>
        <h5>سريعين مرة</h5>
        <p>
          نحن السالميه كلينيك (مجمع عيادات خاصة ) متخصصون في تقديم الخدمات الطبية على أسس أحدث ما توصل اليه العلم. نحن
          ننمو وإرضاء عملائنا هو غايتنا ونحن نعتبر أنفسنا رائدين في طب أمراض الغدد الصماء وذلك تحت رعاية الدكتورة /
          لطيفه الدويسان .نحن نعمل في تناغم لتقديم سيمفونية من الطب في التخصصات المختلفة ونلتزم بأعلى المعايير الطبيه
          الدوليه لنرتقي بصحة وأمان المواطن الكويتي.
        </p>
      </ServiceCard>
      <ServiceCard>
        <h5>دقيقين الف</h5>
        <p>
          نحن السالميه كلينيك (مجمع عيادات خاصة ) متخصصون في تقديم الخدمات الطبية على أسس أحدث ما توصل اليه العلم. نحن
          ننمو وإرضاء عملائنا هو غايتنا ونحن نعتبر أنفسنا رائدين في طب أمراض الغدد الصماء وذلك تحت رعاية الدكتورة /
          لطيفه الدويسان .نحن نعمل في تناغم لتقديم سيمفونية من الطب في التخصصات المختلفة ونلتزم بأعلى المعايير الطبيه
          الدوليه لنرتقي بصحة وأمان المواطن الكويتي.
        </p>
      </ServiceCard>
      <ServiceCard>
        <h5>دعم فني نار</h5>
        <p>
          نحن السالميه كلينيك (مجمع عيادات خاصة ) متخصصون في تقديم الخدمات الطبية على أسس أحدث ما توصل اليه العلم. نحن
          ننمو وإرضاء عملائنا هو غايتنا ونحن نعتبر أنفسنا رائدين في طب أمراض الغدد الصماء وذلك تحت رعاية الدكتورة /
          لطيفه الدويسان .نحن نعمل في تناغم لتقديم سيمفونية من الطب في التخصصات المختلفة ونلتزم بأعلى المعايير الطبيه
          الدوليه لنرتقي بصحة وأمان المواطن الكويتي.
        </p>
      </ServiceCard>
      <ServiceCard>
        <h5>اقوى شي من الأخر </h5>
        <p>
          نحن السالميه كلينيك (مجمع عيادات خاصة ) متخصصون في تقديم الخدمات الطبية على أسس أحدث ما توصل اليه العلم. نحن
          ننمو وإرضاء عملائنا هو غايتنا ونحن نعتبر أنفسنا رائدين في طب أمراض الغدد الصماء وذلك تحت رعاية الدكتورة /
          لطيفه الدويسان .نحن نعمل في تناغم لتقديم سيمفونية من الطب في التخصصات المختلفة ونلتزم بأعلى المعايير الطبيه
          الدوليه لنرتقي بصحة وأمان المواطن الكويتي.
        </p>
      </ServiceCard>
    </ServiceCards>
  </StyledServices>
);

export default Services;
